_posts/2016-10-15-ownmailbox-on-rpi.html
---
layout:     post
title:      Install your Own-Mailbox on your RaspberryPi
date:       2016-10-15
summary: Own-Mailbox is a personal email server you can run in your own home,
  with strong privacy protection measures integrated at its core. It
  provides self-hosted email addresses, and allows you to protect the
  content of your emails, and the meta-data, from mass surveillance.
  I will describe here how I installed it on RPi3 with Docker.
tags: [linux RPi]
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-21 Fri 08:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Install your Own-Mailbox on your RaspberryPi</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">Install your Own-Mailbox on your RaspberryPi</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Install Linux on RPi3</a></li>
<li><a href="#orgheadline2">2. Make the box headless</a></li>
<li><a href="#orgheadline3">3. Install Docker</a></li>
<li><a href="#orgheadline4">4. Install Own-Mailbox</a></li>
<li><a href="#orgheadline5">5. Setup and test Own-Mailbox</a></li>
</ul>
</div>
</div>

<p>
<a href="https://www.own-mailbox.com/">Own-Mailbox</a> is a personal email server you can run in your own home,
with strong privacy protection measures integrated at its core. It
provides self-hosted email addresses, and allows you to protect the
content of your emails, and the meta-data, from mass surveillance.
I will describe here how I installed it on RPi3 with Docker.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Install Linux on RPi3</h2>
<div class="outline-text-2" id="text-1">
<p>
First of all we need to install some version of Linux on our RPi.
I tried Ubuntu MATE and it was great. Instructions for downloading
and writing it on microSDHC are here: <a href="https://ubuntu-mate.org/raspberry-pi/">https://ubuntu-mate.org/raspberry-pi/</a>
I preferred the terminal way:
</p>
<pre class="example">
sudo apt-get install gddrescue xz-utils
unxz ubuntu-mate-16.04-desktop-armhf-raspberry-pi.img.xz
sudo ddrescue -D --force ubuntu-mate-16.04-desktop-armhf-raspberry-pi.img /dev/sdx
</pre>

<p>
Once the microSDHC is ready, we can put it on RPi3 and power it on. Of
course, we also need to attach a keyboard, mouse and TV display to it.
Once it is booted, it will start the configuration of the system
(asking for a username and password, etc.).  When this is done, we
should also resize the partition in order to make full use of the
microSHDC card capacity, as described on the page above. I did it
from the terminal:
</p>
<pre class="example">
sudo su
echo 'd,2,n,p,2,,,w' | tr ',' '\n' | fdisk /dev/mmcblk0
reboot
</pre>

<p>
The next thing to do is to update/upgrade the system, since there may be
any security patches:
</p>
<pre class="example">
sudo su
apt-get update
apt-get upgrade
</pre>

<p>
I also install <code>vim</code> and <code>aptitude</code> on every new system:
</p>
<pre class="example">
apt-get install vim aptitude
</pre>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Make the box headless</h2>
<div class="outline-text-2" id="text-2">
<p>
A headless computer is one that does not have a monitor and is
accessed and managed from the network. For this to work, it needs to
have a fixed IP address (instead of a random one given by a DHCP
server), so that we know where to access it. Besides this it also
needs a <b>SSH</b> server and a <b>VNC</b> server, which allow us to access it remotely.
</p>

<p>
This article shows how to edit the network connections in order to set
a fixed IP: <a href="https://funnyvale.com/how-to-set-up-wifi-on-raspberry-pi-3/">https://funnyvale.com/how-to-set-up-wifi-on-raspberry-pi-3/</a>
On the tab <code>IPv4 Settings</code> you should also set a manual fixed IP, like
<code>192.168.0.200</code>, instead of the dynamic configuration.
</p>

<p>
From the GUI you can also set a fixed IP for the wired connection.
But I prefer to do it from the terminal. I edit the file
<code>/etc/network/interfaces</code> and append lines like these:
</p>
<pre class="example">
auto enxb827eb3c62f4
iface enxb827eb3c62f4 inet static
    address 192.168.1.200
    netmask 255.255.255.0
iface enxb827eb3c62f4 inet static
    address 192.168.100.200
    netmask 255.255.255.0
</pre>
<p>
Here <code>enxb827eb3c62f4</code> is the name of the network interface, which has
changed on ubuntu 16.04 (it was something like <code>eth0</code> previously).
</p>

<p>
Let's install also <code>openssh-server</code> and <code>tightvncserver</code>.
</p>
<pre class="example">
apt-get install openssh-server
apt-get install tightvncserver
</pre>

<p>
After rebooting, we can access the box through wifi or a cable like
this: <code>ssh user@192.168.0.200</code> (wifi), or <code>ssh user@192.168.1.200</code> or
<code>ssh user@192.168.100.200</code>.
</p>

<p>
For a headless box (as RPi usually is) we should also disable the GUI:
<code>graphical disable</code> and <code>reboot</code>. Dispite this, we can still access
its GUI desktop remotely through VNC. This can be done by starting
first a vnc server (and setting a password) with the command:
<code>vncserver</code>.  We can access the vnc desktop with a command like this:
<code>vncviewer 192.168.0.200:1</code>. (We may need to install it with <code>aptitude
install vncviewer</code>, in case it is not installed.)
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Install Docker</h2>
<div class="outline-text-2" id="text-3">
<p>
I installed Docker following the instructions from this article:
<a href="http://blog.hypriot.com/post/run-docker-rpi3-with-wifi/">http://blog.hypriot.com/post/run-docker-rpi3-with-wifi/</a>
</p>

<pre class="example">
echo "overlay" | sudo tee -a /etc/modules
sudo apt-get install -y apt-transport-https
wget -q https://packagecloud.io/gpg.key -O - | sudo apt-key add -
echo 'deb https://packagecloud.io/Hypriot/Schatzkiste/debian/ wheezy main' | sudo tee /etc/apt/sources.list.d/hypriot.list
sudo apt-get update
sudo apt-get install -y docker-hypriot
sudo systemctl enable docker
</pre>

<p>
Checking the version of docker:
</p>
<pre class="example">
# docker version
Client:
 Version:      1.11.1
 API version:  1.23
 Go version:   go1.4.3
 Git commit:   5604cbe
 Built:        Mon May  9 00:50:14 2016
 OS/Arch:      linux/arm

Server:
 Version:      1.11.1
 API version:  1.23
 Go version:   go1.4.3
 Git commit:   5604cbe
 Built:        Mon May  9 00:50:14 2016
 OS/Arch:      linux/arm
</pre>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Install Own-Mailbox</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
git clone https://github.com/Own-Mailbox/docker omb
cd omb/
./docker.sh build
./docker.sh create
./docker.sh install
</pre>

<p>
Then you can access the web interface at the address <a href="http://192.168.0.250/">http://192.168.0.250/</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Setup and test Own-Mailbox</h2>
<div class="outline-text-2" id="text-5">
<p>
See:
</p>
<ul class="org-ul">
<li><a href="https://www.own-mailbox.com/alpha-manual.pdf">https://www.own-mailbox.com/alpha-manual.pdf</a></li>
<li><a href="https://www.own-mailbox.com/video/Alpha-demo.webm">https://www.own-mailbox.com/video/Alpha-demo.webm</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-10-15</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2016-10-21 Fri 08:36</p>
<p class="validation"></p>
</div>
</body>
</html>
